{
    "title": "I. God Is Love",
    "heroImage": "",
    "most_fundamental_quality": {
        "title": "Most Fundamental Quality",
        "items": [
            {
                "id": "god_essence_not_attribute",
                "title": "Not just an attribute, but God’s essence",
                "detail": "\n<br/>\nLove is not one trait among many; it is the very substance of Deity. Scripture’s brief creed—“God is love”—locates benevolence at the core of every other divine quality, so that justice, power, and judgment are love in action, never in tension with it. Grasping this single truth reshapes doctrine into commentary on unfailing affection. Every page of revelation becomes an illustration of compassion seeking to win back trust. In such a universe, true obedience is the glad echo of perceived goodness. This centripetal principle unites all divine activity in a single motivating pulse.\n<br/><br/>\n<i>See The Larger View, p. 145</i>"
            },
            {
                "id": "expressed_in_gods_inner_reality",
                "title": "Expressed in God’s inner reality",
                "detail": "\n<br/>\nWithin the fellowship of Father, Son, and Spirit, love flows in ceaseless self-giving long before any creature existed. Calvary simply unveils in time what eternity has always been. Redemption does not persuade Heaven to change its mind; it invites earth to share the life already pulsing within the Godhead. Participation in that communion is the very heart of salvation, the joy set before us. In that embrace lies the assurance that life eternal is relational, not transactional. Such sharing is what turns theology into doxology, transforming knowledge into joyous trust."
            }
        ]
    },

    "boundless_infinite_exhaustless": {
    "title": "Boundless, Infinite, Exhaustless",
    "items": [
        {
            "id": "human_analogies_fall_short",
            "title": "Human analogies always fall short",
            "detail": "\n<br/>\nEven the purest parental devotion cannot span the breadth of divine compassion. Eternity itself will still leave creatures marvelling at love’s dimensions, for language fractures before such immensity. All comparisons must therefore be held loosely lest Majesty be shrunk to creaturely size. The cross alone begins to hint at the fathomless tenderness that pulses in the heart of God. Silence becomes the soul’s final act of praise when words betray their poverty. Awe, not analysis, is the appropriate response to limitless mercy."
        },
        {
            "id": "eternal_self_giving_within_godhead",
            "title": "Eternally self-giving love within the Godhead",
            "detail": "\n<br/>\nThe Father eternally pours Himself into the Son; the Son answers in delighted reciprocity; the Spirit binds the circle in other-centred joy. Calvary does not originate this movement but publishes it to angels and mortals. Those who trust are swept into the same current of self-forgetting fellowship. Heaven’s own life becomes theirs, now and forever, as shared vitality replaces mere existence. Mutual deference, never rivalry, governs the throne of the cosmos. Thus the Trinity itself is the gospel’s first sermon."
        },
        {
            "id": "no_limit_even_toward_rebels",
            "title": "No limit even toward rebels",
            "detail": "\n<br/>\nDivine affection pursues the most wayward without fatigue or resentment. “How can I give you up?” cries the wounded parent who longs to heal, not to punish. The cross proves that love pre-existed forgiveness; it did not ignite when blood was shed. Only stubborn refusal can finally place a soul beyond its reach, yet even then grief remains. Love respects freedom even when it breaks the Lover’s heart. Such lament exposes the costliness of grace and the peril of rejecting it."
        }
    ]
},

    "leads_god_to_take_risks": {
    "title": "Leads God to Take Risks",
    "items": [
        {
            "id": "freedom_necessitates_risk",
            "title": "Freedom necessitates risk of rebellion",
            "detail": "\n<br/>\nBecause love cannot compel, genuine freedom must exist even at the hazard of revolt. A universe run by force would be a cosmic penitentiary—something love forever refuses. Liberty grants creatures the option to say no, making trust possible though never mechanized. The resulting controversy showcases how Omnipotence chooses suffering over coercion, proving that love is stronger than fear. Such freedom dignifies the creature and vindicates the Creator before the watching universe. The costliness of liberty thus becomes the clearest evidence of divine goodness."
        },
        {
            "id": "incarnation_as_ultimate_vulnerability",
            "title": "Incarnation as ultimate vulnerability",
            "detail": "\n<br/>\nWhen the Word became flesh, Infinity embraced the possibility of misunderstanding, betrayal, and death. Every meal shared with sinners—even a traitor—revealed forgiveness that precedes repentance. On the cross the Sin-bearer experienced the awful separation sin causes, not Father-inflicted torment, standing with humanity in its darkest hour. That shared suffering settles each accusation raised against the heart of God. Resurrection then seals the proof that self-giving love cannot be conquered by evil. The risen scars testify forever that power serves, it never subjugates."
        },
        {
            "id": "ongoing_openness_to_rejection",
            "title": "Ongoing openness to rejection",
            "detail": "\n<br/>\nEven after Calvary, creatures remain free to refuse friendship. The Spirit woos but never shackles the will; love respects choice to the final breath. Persistent rejection must at last be honored, and harvest follows sowing. Such sorrowful consent underscores that relationship—not dominance—is the law of the kingdom. Final judgment therefore reveals consequence rather than coercion, exposing sin’s intrinsic ruin. Love’s grief over lost children becomes the strongest warning against self-chosen exile."
        }
    ]
},

    "makes_god_dynamically_responsible": {
    "title": "Makes God Dynamically Responsible",
    "items": [
        {
            "id": "covenant_faithfulness_engages_history",
            "title": "God’s covenant faithfulness engages history",
            "detail": "\n<br/>\nAcross millennia the Divine Teacher adapts His methods to human capacity: simple promises, symbolic rituals, prophetic stories, then the living Word. Each stage protects freedom while unveiling character. Discipline, exile, and deliverance all share one objective—winning back trust so healing may begin. History itself becomes a gallery of love’s patience and ingenuity, showing that God never abandons His family. Every chapter whispers, “Can you trust Me now?” and waits for an answering yes. When that answer comes, the covenant reaches its true goal—friendship restored."
        },
        {
            "id": "participatory_healing_not_coercion",
            "title": "Participatory healing rather than coercion",
            "detail": "\n<br/>\nAtonement is heaven’s medicine, not a mere ledger entry. When hearts trust the Physician, the remedy can cleanse memory, restore desire, and renew life. Obedience becomes a humble willingness to listen, inviting treatment instead of resisting it. Legal pardon is only the doorway; transformation is the home beyond, where health replaces mere survival. Love’s goal is nothing less than restored likeness to the Healer, so that healed ones become healers in His name. Salvation thus moves from courtroom language to the language of the clinic and family."
        },
        {
            "id": "adaptive_strategies_within_gc",
            "title": "Adaptive strategies within the Great Controversy",
            "detail": "\n<br/>\nThe cosmic debate over God’s government explains the variety of divine interventions. Early acts—flood, fire—exposed sin’s destructive end, yet fear could not secure loyalty. Gentler measures followed, culminating in the cross, where force was forever discredited and love revealed as the greatest power. There the universe sees that fear breeds death, while trusting love brings life unending. Every strategy, whether dramatic or tender, converges on one evidence: God is safe to trust. Victory is finally won not by might but by the persuasive beauty of self-giving love."
        }
    ]
}

}