{
    "title": "I. The Problem: A Cosmic War Between God and Evil Powers",
    "heroImage": "https://cdn.midjourney.com/9bc1e23f-8903-46ee-84b3-93c2a1c0d5b6/0_2.png",
    "rejecting_blueprint_worldview": {
        "title": "Rejecting the 'Blueprint Worldview' of Divine Sovereignty",
        "items": [
            {
                "id": "critique_traditional_theodicy",
                "title": "Critique of traditional theodicy that attributes all events to God's mysterious purposes",
                "detail": "\n<br/>\nWhen we're told that everything happens according to God's sovereign plan—that cancer, school shootings, and natural disasters all somehow serve his mysterious purposes—we're being asked to believe something that would make God a cosmic child abuser. This 'blueprint worldview' assumes that for God to be sovereign, he must meticulously control every event. But this makes God the author of evil and turns theology into an exercise in defending the indefensible. The Bible never asks us to find divine reasons for Satan's work. Instead, it calls us to resist evil as evidence of rebellion against God's will.\n<br/><br/>\n<i>See God at War, pp. 53-80</i>"
            },
            {
                "id": "problem_evil_no_divine_reasons",
                "title": "The problem of evil cannot be solved by appealing to divine 'reasons' for suffering",
                "detail": "\n<br/>\nWhen a little girl is kidnapped, tortured, and murdered, there is no divine 'why' that makes this acceptable. Evil is not God working in mysterious ways—it's Satan working in predictable ways. The warfare worldview doesn't ask us to find hidden purposes in atrocities. Instead, it recognizes them as casualties in a cosmic war between God and the powers of darkness. We don't need to defend God from evil; we need to join God in fighting against it. The cross proves that God is on the side of victims, not the perpetrator of their suffering.\n<br/><br/>\n<i>See Satan and the Problem of Evil, pp. 293-320</i>"
            },
            {
                "id": "resigned_acceptance_vs_nt_expectation",
                "title": "Modern Christianity's resigned acceptance versus New Testament expectation to fight evil",
                "detail": "\n<br/>\nSomewhere along the way, the church traded the New Testament's call to spiritual warfare for philosophical resignation. When tragedy strikes, we're taught to say 'God has his reasons' instead of 'How can we fight this evil?' But Jesus didn't teach his disciples to be passive in the face of suffering. He taught them to cast out demons, heal the sick, and resist the powers of darkness. The early church expected evil and knew how to fight it. We've become so committed to defending God's reputation that we've forgotten he's already at war with everything that destroys his children.\n<br/><br/>\n<i>See The Crucifixion of the Warrior God, Volume 1, pp. 435-442</i>"
            },
            {
                "id": "inadequacy_god_has_reasons",
                "title": "The inadequacy of 'God has his reasons' mentality in face of genuine evil",
                "detail": "\n<br/>\nWhen parents lose a child to cancer and well-meaning Christians tell them 'God needed another angel in heaven,' they're not offering comfort—they're offering theology that makes God a monster. These clichés don't honor God; they make him responsible for the very evil he came to destroy. The cross reveals that God doesn't orchestrate suffering to teach us lessons or accomplish his purposes. He enters into our suffering to heal it. There's a profound difference between finding meaning in suffering and attributing suffering to God. One leads to hope; the other leads to despair disguised as faith."
            }
        ]
    },
    "biblical_warfare_worldview": {
        "title": "The Biblical Warfare Worldview as Foundational Framework",
        "items": [
            {
                "id": "cosmic_conflict_god_satan",
                "title": "Scripture presents reality as cosmic conflict between God and Satan's kingdom",
                "detail": "\n<br/>\nFrom Genesis to Revelation, the Bible tells the story of a cosmic war. It's not a war between equal powers—Satan is a defeated foe—but it's a real conflict nonetheless. Jesus didn't come to fulfill a legal contract with the Father; he came to 'destroy the works of the devil' and 'drive out the prince of this world.' This warfare motif runs through every page of Scripture, yet we've somehow managed to turn Christianity into a legal transaction between the Father and Son. When we recover the warfare worldview, everything changes. Prayer becomes warfare, ministry becomes liberation, and the cross becomes victory.\n<br/><br/>\n<i>\"For this purpose the Son of God was manifested, that he might destroy the works of the devil\" (1 John 3:8)</i>"
            },
            {
                "id": "evil_rebellious_wills",
                "title": "Evil originates from rebellious wills (human and angelic) opposing God's purposes",
                "detail": "\n<br/>\nEvil doesn't come from God—it comes from creatures who have chosen to rebel against God's loving will. This isn't a cop-out; it's the consistent biblical explanation for why bad things happen to good people. Satan isn't God's hit man carrying out divine orders. He's a cosmic rebel leading an insurrection against the kingdom of love. When we blame God for what Satan does, we're joining the enemy's propaganda campaign. The Bible is clear: God is light, and in him is no darkness at all. Every evil we see in this world represents a violation of God's will, not its fulfillment."
            },
            {
                "id": "god_fights_evil_powers",
                "title": "God fights against evil powers rather than orchestrating their activities for higher purposes",
                "detail": "\n<br/>\nThe God revealed in Jesus Christ doesn't play chess with evil—he wages war against it. When Jesus encountered demons, he didn't thank the Father for sending them to teach valuable lessons. He cast them out. When he saw sickness, he didn't praise God for the opportunity to build character. He healed people. The pattern is unmistakable: God opposes everything that destroys his children. This means that when we see evil in the world, our default response shouldn't be to find God's hidden purpose in it. Our response should be to join God in fighting against it.\n<br/><br/>\n<i>See The Nature of the Atonement: Four Views, pp. 23-49</i>"
            },
            {
                "id": "open_theism_foundation",
                "title": "Open theism foundation: God knows possibilities but not predetermined outcomes",
                "detail": "\n<br/>\nIf God knows everything that will happen with absolute certainty, then everything that happens—including every evil—is something God has eternally known would occur and has chosen not to prevent. This makes God complicit in every horror. But Scripture presents a God who genuinely responds to prayer, changes his mind, and experiences surprise and grief. The future isn't a movie God has already watched; it's a story he's writing with free agents who can choose to cooperate or rebel. This openness doesn't diminish God's sovereignty—it reveals a God who is confident enough in his love to risk genuine relationship.\n<br/><br/>\n<i>See God of the Possible, pp. 97-135</i>"
            }
        ]
    },
    "scope_cosmic_conflict": {
        "title": "The Scope and Nature of the Cosmic Conflict",
        "items": [
            {
                "id": "warfare_encompasses_all_creation",
                "title": "Spiritual warfare encompasses all creation, not merely human salvation",
                "detail": "\n<br/>\nThe cross wasn't just about getting humans into heaven—it was about liberating all creation from bondage to evil. Paul tells us that the whole creation has been groaning, waiting for redemption. This cosmic scope helps us understand why natural disasters, disease, and death itself are enemies to be conquered, not divine tools to be accepted. When Jesus stilled the storm, he wasn't just showing off his power; he was demonstrating that the forces of chaos are not God's servants but his enemies. The good news is that God's victory extends to every corner of creation infected by evil.\n<br/><br/>\n<i>\"For the creation waits with eager longing for the revealing of the sons of God\" (Romans 8:19)</i>"
            },
            {
                "id": "satan_limited_but_real_power",
                "title": "Satan as 'god of this world' and 'prince of this world' with real but limited power",
                "detail": "\n<br/>\nSatan's power is real but derivative, significant but not ultimate. The New Testament calls him the 'god of this world' and the 'prince of this world,' titles that indicate genuine authority over fallen systems and structures. But he's a usurper, not a legitimate ruler. His kingdom is built on lies, violence, and death—principles that are ultimately self-defeating. The cross exposed his powerlessness and guaranteed his defeat. Still, like any defeated enemy, he continues to wreak havoc until he's finally removed from the battlefield. Understanding both his reality and his limitations helps us take him seriously without giving him too much credit."
            },
            {
                "id": "demonic_forces_active_opposition",
                "title": "Demonic forces actively opposing God's will in the physical and spiritual realms",
                "detail": "\n<br/>\nThe Western church has largely abandoned belief in demons, preferring psychological and sociological explanations for evil. But Jesus spent much of his ministry casting out demons, and he expected his followers to do the same. These aren't primitive superstitions; they're spiritual realities that help explain the depth and persistence of evil in our world. When we ignore the demonic dimension of evil, we fight the battle with one hand tied behind our backs. Prayer, deliverance ministry, and spiritual discernment become essential tools in the cosmic conflict, not optional extras for the spiritually minded."
            },
            {
                "id": "already_not_yet_tension",
                "title": "The 'already but not yet' tension of Christ's victory over powers",
                "detail": "\n<br/>\nThe cross was D-Day in the cosmic conflict—the decisive battle that guaranteed ultimate victory. But like the period between D-Day and V-E Day, we're living in the aftermath of victory while still experiencing the reality of war. Satan has been defeated, but he hasn't yet been destroyed. The kingdom of God has come, but it hasn't yet come in fullness. This explains why we can have confidence in God's ultimate victory while still experiencing real spiritual warfare. We fight from victory, not for victory, but we still fight.\n<br/><br/>\n<i>\"He disarmed the rulers and authorities and put them to open shame, by triumphing over them in him\" (Colossians 2:15)</i>"
            }
        ]
    }
}