{
  "title": "IV. Healing Salvation & Practical Obedience",
  "heroImage": "",

  "atonement_as_healing": {
    "title": "Atonement as Healing",
    "items": [
      {
        "id": "salvation_as_divine_medicine",
        "title": "Salvation as Divine Medicine",
        "detail": "\n<br/>\nSalvation is profoundly understood as divine medicine, a healing process, not merely a legal transaction. The Greek word sōzō, often translated as salvation, fundamentally means \"healing,\" signifying a comprehensive restoration of all sin's damage. While God is forgiveness personified and has always extended pardon, this forgiveness only opens the channel for His remedy to be received. Trust is the crucial element; without it, God's gracious provisions are of no avail, for He cannot force healing on an unwilling heart. Our Father’s ultimate longing is to win us back to trust, enabling Him to heal the damage sin has wrought physically, mentally, spiritually, and socially. Re-established trust lets Him transform us with new hearts and right spirits, making us safe for His kingdom."
      },
      {
        "id": "more_than_legal_pardon",
        "title": "More Than Legal Pardon",
        "detail": "\n<br/>\nSalvation, as God intends it, is far more than a legal pardon or a change in our heavenly record. Sin is a breach of trust that has inflicted devastating physical, mental, spiritual, and social consequences, leaving us dying rather than merely guilty. The atonement is therefore a divine remedy that cures transgression and restores spiritual health, aiming for character transformation, not mere status change. God’s plan is to win us back to confidence so He can fully heal the damage sin has done, truly \"setting us right.\" He will welcome only those who genuinely desire loving kindness, renewed with new hearts and right spirits. Forgiveness, freely granted, simply prepares us to receive the deeper healing of being \"born again.\""
      }
    ]
  },

  "relational_obedience": {
    "title": "Relational Obedience",
    "items": [
      {
        "id": "obedience_as_humble_listening",
        "title": "Obedience as Humble Listening",
        "detail": "\n<br/>\nTrue obedience is not forced compliance but a humble willingness to listen—*hupakoē*—that flows from genuine trust and love. Like a faithful gatekeeper attentively opening the door, it shows God seeks understanding, not mere servitude. He plainly rejects the service of fear, knowing coerced obedience breeds the character of a rebel—the very essence of sin. Instead, He values the free submission born of deep admiration for His wise and gracious ways. His commandments are thus guarantees of freedom, securing a universe where trust and love prevail. Obedience therefore becomes the joyous expression of healed hearts."
      },
      {
        "id": "from_servants_to_friends",
        "title": "From Servants to Friends",
        "detail": "\n<br/>\nThe divine invitation calls us from mere servants to genuine friends of God. Jesus declared, \"No longer do I call you servants, for the servant does not know what his master is doing.\" But He added, \"I have called you friends, for everything I heard from My Father I have made known to you\" (John 15:15). While faithful servitude is commendable, God longs for a bond where understanding—not fear or reward—is the prime motive. Servants seek legal standing and avoidance of punishment, whereas friends, like Abraham and Moses, engage in mutual trust and open dialogue. Calvary proves we need not fear God, showing that true at-one-ment is friendship born of admiration and love, never coercion."
      }
    ]
  },

  "pastoral_and_missional_implications": {
    "title": "Pastoral & Missional Implications",
    "items": [
      {
        "id": "nonviolent_witness_enemy_love",
        "title": "Non-Violent Witness & Enemy-Love",
        "detail": "\n<br/>\nA gospel centered on God’s trustworthiness demands a witness marked by non-violence and authentic enemy-love, disarming every hint of coercion. God’s good news about Himself is demonstrated through gracious acts, not forceful assertions or threats. Just as Jesus treated notorious sinners with grace, God pursues us by winning hearts, never by compelling allegiance. We are called to mirror this trust-based approach, gaining confidence through tact, wisdom, and fervent love rather than debate or hostility. Such witness avoids depicting a tyrannical deity who enforces unity through fear, instead revealing His patient, persistent love—even toward resisters. This gracious persuasion mirrors heaven’s strategy for securing the universe in freedom."
      },
      {
        "id": "believers_as_agents_of_healing",
        "title": "Believers as Agents of Healing",
        "detail": "\n<br/>\nRecipients of God’s healing salvation become agents in a ministry of reconciliation, health, and justice—living proof of participatory atonement. Salvation means more than improved legal standing; it entails profound character transformation that makes us safe companions for eternity. God longs to see us \"born again\" with new hearts and right spirits, authentically reflecting His own kindness. The church’s mission is to foster this unity and \"at-one-ment\" among those who love and trust the same God. When we cooperate with the divine Physician, allowing Him to heal us, our lives become compelling evidence of His reliability and draw others to Him. Healing thus turns disciples into living parables of the gospel."
      }
    ]
  },

  "final_restoration_new_earth": {
    "title": "Final Restoration & New Earth",
    "items": [
      {
        "id": "universe_secure_in_trust",
        "title": "Universe Secure in Trust",
        "detail": "\n<br/>\nGod’s redemptive aim is a universe eternally secure in established trust, where every intelligence stands satisfied with His character. The Great Controversy climaxed at the cross, the costliest and most convincing evidence of His self-renouncing love. God submitted His government to creature scrutiny, letting the universe judge for itself. The final judgment—Heaven’s court—settles any lingering questions, confirming the truth of His ways. Thus universal peace, freedom, and security rest on an unshakeable foundation of trust. In such a climate, fear evaporates and gratitude fuels everlasting harmony."
      },
      {
        "id": "eternal_growth_no_rebellion",
        "title": "Eternal Growth, No Fear of Rebellion",
        "detail": "\n<br/>\nWith trust eternally confirmed, the universe can grow forever without the fear of another rebellion. God’s unwavering commitment to cosmic freedom, even at infinite cost, ensures unity based on understanding, never coercion. The lessons of the Great Controversy guarantee that doubts about His character will never again arise. The second death—no torture, only final cessation—prevents a free universe from becoming a cosmic prison. In this order founded on love and trust, all beings expand in knowledge and joy without reservation. Ever-unfolding discoveries await without the shadow of suspicion ever returning."
      }
    ]
  }
}
