{
  "title": "II. Trust & the Great Controversy",
  "heroImage": "",

  "nature_of_sin_and_faith": {
    "title": "Nature of Sin & Faith",
    "items": [
      {
        "id": "sin_as_distrust",
        "title": "Sin as Distrust, Not Mere Lawbreaking",
        "detail": "\n<br/>\nSin is far more than the violation of a legal code; it is the rupture of relational trust. Lucifer’s first doubts spread like an infection, turning suspicion into cosmic war and leaving the universe trembling on the brink of chaos. Rules merely describe the health that love produces, but distrust corrodes heart, mind, and community until peace is impossible. Thus the real danger is not execution at God’s hand but the destructive harvest of cherished suspicion. Calvary shows that distrust, once released, can kill even the Creator. Healing begins only when that suspicion is replaced by confidence in divine reliability."
      },
      {
        "id": "faith_as_relational_trust",
        "title": "Faith Defined as Relational Trust",
        "detail": "\n<br/>\nFaith is not a bare admission that God exists—devils possess that and tremble. True faith is a humble willingness to listen, the relational trust captured by the Greek word *pistis*. God seeks voluntary reverence, admiration, and cooperation born of His proven worthiness. Such trust cannot be commanded or shortcut; it grows as God demonstrates credibility under the most trying circumstances. Forgiveness flows freely, yet it brings lasting healing only when the forgiven are won back to trust. Salvation becomes safe because transformed hearts now delight in the God whose character they once doubted."
      }
    ]
  },

  "cosmic_conflict_audience": {
    "title": "Cosmic Conflict & Audience",
    "items": [
      {
        "id": "universal_audience",
        "title": "Universal Audience in the Cosmic Conflict",
        "detail": "\n<br/>\nThe Great Controversy is waged before a universal audience—angels and unfallen worlds watch Earth’s drama unfold. Christ’s death was not for humanity alone but to reconcile \"things in heaven\" as Colossians declares. Even loyal beings carried unanswered questions that, if ignored, could have seeded further rebellion. The cross provided the faith-confirming evidence heaven required to trust God eternally. Earth thus serves as a theater where divine truth is displayed for all intelligences. The final result will be an everlasting \"at-one-ment\" binding the entire family of God."
      },
      {
        "id": "satanic_accusations",
        "title": "Satan’s Core Accusations Against God",
        "detail": "\n<br/>\nSatan portrayed the Creator as arbitrary, vengeful, and unworthy of trust, twisting Eden’s warning into a threat of execution. His boldest claim was that God had lied—sin would not truly result in death. Happiness, he said, lay in self-service, while obedience born of fear warped souls into rebels. The controversy thus turns on a single question: who tells the truth about reality and about God’s motives? Until those accusations were publicly refuted, lingering doubt could poison the universe. Calvary exposes the falsity of every charge and unmasks the lethal nature of selfishness."
      }
    ]
  },

  "cross_and_vindication": {
    "title": "Cross & Vindication",
    "items": [
      {
        "id": "cross_as_demonstration",
        "title": "Cross as Demonstration, Not Transaction",
        "detail": "\n<br/>\nAtonement means \"at-one-ment\"—the costly restoration of harmony, not appeasement of divine wrath. Jesus did not die to persuade His Father to be kind; He died to reveal that the Father had always been trustworthy. Calvary acts as a remedy, curing the disease of distrust by displaying love under fire. The focus therefore shifts from legal payment to relational reconciliation and healing. God must be reconciled to no one; we, the suspicious, need reconciliation to Him. The cross is the grand exhibit that God’s heart is the safest place in the universe."
      },
      {
        "id": "vindication_at_calvary",
        "title": "Vindication of Divine Character at Calvary",
        "detail": "\n<br/>\nCalvary supplies the most convincing evidence about God’s government. Jesus’ voluntary death proved three things: sin does causally lead to death, the Father does not execute transgressors, and fear-based service breeds rebellion. \"Why have You given Me up?\" reveals divine \"wrath\" as sorrowful release, not active torture. That it was God Himself who suffered prevents the lie that He kills His children. The cross thus forever settles the issue that there is no need to be afraid of God."
      }
    ]
  },

  "progressive_revelation": {
    "title": "Progressive Revelation",
    "items": [
      {
        "id": "progressive_self_revelation",
        "title": "Progressive Self-Revelation in Scripture",
        "detail": "\n<br/>\nGod’s self-disclosure unfolded in many ways—promises, symbols, prophets—each tailored to human readiness. Because stubborn hearts misunderstood love, emergency measures like the sacrificial system were added, though they risked obscuring the truth they pointed toward. The Decalogue itself expressed principles of trust in \"Thou-shalt-not\" form because of pervasive rebellion. Ultimately Jesus became the clearest revelation, embodying what could not be fully conveyed at Sinai. His life corrects distortions, showing the Father to be neither arbitrary nor severe. Revelation is therefore progressive, always moving toward clearer pictures of trustworthy love."
      },
      {
        "id": "prophetic_case_studies",
        "title": "Prophetic Narratives as Case Studies in Trust",
        "detail": "\n<br/>\nScripture functions like a medical casebook charting God’s efforts to restore confidence. Abraham grows from faltering apprentice to \"friend of God\"; Moses argues boldly with divine purpose; Job’s loyalty under duress silences heavenly debate. Each story shows that God values honest dialogue over fearful submission. The Prodigal Son parable crowns the testimony: reconciliation occurs the moment the Father’s embrace is accepted, proving love precedes repentance. Servants obey from fear, but friends obey from understanding; such friendship is the real at-one-ment God seeks."
      }
    ]
  }
}
