{
  "title": "III. Soteriological & Ethical Implications",
  "heroImage": "https://cdn.midjourney.com/7ef7721d-389b-4523-847d-1e096931d9d0/0_1.png",
  "salvation_as_liberation_into_shalom": {
    "title": "Salvation as Liberation into Shalom",
    "items": [
      {
        "id": "healing_individuals_societies_from_cycles_of_retaliation",
        "title": "Healing individuals & societies from cycles of retaliation",
        "detail": "\n<br/>\nWeaver portrays salvation as the mending of broken relationships at every level of human existence. Christ’s nonviolent victory exposes the futility of revenge and empowers wounded people to forgive without erasing justice. Communities that embrace this healing become laboratories of peace, interrupting generational patterns of harm. The gospel thus promises concrete social transformation, not merely private reassurance."
      },
      {
        "id": "re_creation_of_just_relationships_under_servant_king_authority",
        "title": "Re-creation of just relationships under servant-king authority",
        "detail": "\n<br/>\nInstead of reinstating hierarchical domination, the risen Jesus inaugurates a kingdom defined by mutual service. Weaver insists that true redemption restores dignity to both oppressed and oppressor by restructuring power along cruciform lines. Economic, racial, and gender inequities are confronted as violations of shalom. In this renewed order, authority takes the form of foot-washing rather than coercion."
      }
    ]
  },
  "discipleship_shaped_by_the_cross": {
    "title": "Discipleship Shaped by the Cross",
    "items": [
      {
        "id": "enemy_love_as_litmus_test_of_authentic_faith",
        "title": "Enemy-love as litmus test of authentic faith",
        "detail": "\n<br/>\nFor Weaver, the surest sign that the church believes the atonement story is its willingness to bless persecutors. Enemy-love reenacts the cross, demonstrating confidence that God’s power operates through vulnerability. Such practices disarm fear and create unexpected openings for reconciliation. They also expose counterfeit gospels that justify violence in God’s name."
      },
      {
        "id": "nonviolent_resistance_to_systemic_injustice",
        "title": "Nonviolent resistance to systemic injustice",
        "detail": "\n<br/>\nCruciform discipleship does not entail passive acquiescence; it actively confronts oppressive structures without mirroring their brutality. Weaver cites movements from César Chávez to the Civil Rights struggle as embodiments of redemptive protest. By refusing lethal force, believers testify that real power lies in truth and solidarity. Their witness invites society to imagine alternatives to retribution."
      }
    ]
  },
  "political_theology_public_witness": {
    "title": "Political Theology & Public Witness",
    "items": [
      {
        "id": "critique_of_constantinian_church_state_alliances",
        "title": "Critique of Constantinian church-state alliances",
        "detail": "\n<br/>\nWeaver charges that when the church weds imperial power it betrays the cross and muffles its liberating message. The Constantinian bargain trades prophetic courage for privileged status, making violent coercion appear sacred. A Narrative Christus Victor theology insists the church remain a counter-polis, modeling restorative justice rather than policing it with the sword. Such a stance often costs influence, yet preserves the integrity of the gospel."
      }
    ]
  }
}
