{
  "title": "II. Constructing the Narrative Christus Victor Model",
  "heroImage": "https://cdn.midjourney.com/931965e2-1a04-46a9-adc2-ce81fe23e7bf/0_3.png",
  "scripture_as_story_not_system": {
    "title": "Scripture as Story, Not System",
    "items": [
      {
        "id": "canonical_plot_creation_israel_jesus_church_new_creation",
        "title": "Canonical plot: creation-Israel-Jesus-church-new creation",
        "detail": "\n<br/>\nScripture unfolds as a five-act drama that begins with creation, moves through Israel’s vocation, climaxes in Jesus, extends to the church, and anticipates new creation. Weaver argues that atonement must be read within this sweeping narrative, not abstracted into isolated propositions. Each act showcases God’s nonviolent faithfulness confronting evil through covenant rather than coercion. Keeping the whole plot in view guards against shrinking salvation to a single legal transaction."
      },
      {
        "id": "jesus_climax_reveals_divine_character",
        "title": "Jesus as climax revealing God’s character in action and passion",
        "detail": "\n<br/>\nIn Weaver’s telling, Jesus embodies the decisive revelation of who God is and how God saves. His healings, table fellowship, and parables display a kingdom of restorative justice that culminates on the cross. The passion does not contradict the ministry; it intensifies it by absorbing violence without retaliation. Seeing Christ as narrative climax anchors atonement in lived, self-giving love rather than punitive exchange."
      },
      {
        "id": "resurrection_vindicates_nonviolent_obedience",
        "title": "Resurrection vindicating nonviolent obedience",
        "detail": "\n<br/>\nEaster functions as God’s public endorsement of Jesus’ nonviolent way. By raising the executed Messiah, God declares that enemy-love, not violent reprisal, is the true path to victory. Resurrection therefore completes the atonement story, proving the powers powerless when confronted with self-sacrificial fidelity. It fuels the church’s hope that faithful witness can overturn death-dealing systems."
      }
    ]
  },
  "christus_victor_reimagined": {
    "title": "Christus Victor Reimagined",
    "items": [
      {
        "id": "defeat_powers_principalities_not_wrath_appeasement",
        "title": "Defeat of \"powers and principalities\" rather than wrath appeasement",
        "detail": "\n<br/>\nWeaver retools the classic Christus Victor motif, shifting focus from placating divine wrath to liberating creation from oppressive powers. Sin is pictured as enslavement within violent structures, not merely individual guilt. The cross disarms these powers by exposing their futility when confronted with forgiving love. Atonement thus centers deliverance and restoration instead of judicial settlement."
      },
      {
        "id": "cross_exposes_scapegoating_violence",
        "title": "Cross exposing scapegoating logic and systemic violence",
        "detail": "\n<br/>\nDrawing on Girard, Weaver sees the crucifixion as the world’s verdict on innocent suffering made visible. By submitting to execution, Jesus unmasks the lie that peace can be secured through exclusion and bloodshed. The revelation discredits sacrificial myths that justify war and oppression. Followers are therefore called to resist scapegoating wherever it appears."
      },
      {
        "id": "victory_embodied_in_spirit_formed_peace_communities",
        "title": "Victory embodied in Spirit-formed peace communities",
        "detail": "\n<br/>\nThe triumph of Christ becomes tangible when the Spirit fashions congregations that practice reconciliation and justice. Such communities signal to the world that the old order of domination is passing away. Their shared life—across ethnic, economic, and social divides—enacts the liberation proclaimed at the cross. Weaver treats this communal witness as indispensable evidence that atonement is operative."
      },
      {
        "id": "liberation_over_legal_payment_shift",
        "title": "Liberation-over-legal-payment paradigm shift",
        "detail": "\n<br/>\nMoving the conversation from courtroom to battleground reshapes every facet of salvation language. Instead of debts cleared by punishment, sinners are freed from captivity to fear, violence, and death. This shift elevates themes of exodus, exile return, and jubilee as primary biblical touchstones. It also reframes mission as partnering with God to extend liberation in concrete social arenas."
      }
    ]
  },
  "ecclesial_participation_in_the_story": {
    "title": "Ecclesial Participation in the Story",
    "items": [
      {
        "id": "baptism_enlistment_into_peaceable_reign",
        "title": "Baptism: enlistment into God’s peaceable reign",
        "detail": "\n<br/>\nFor Weaver, baptism is not merely symbolic washing but a public drafting into Christ’s nonviolent army. Candidates renounce allegiance to violent powers and pledge loyalty to the servant-king. The rite signals a new identity shaped by cross and resurrection. It inaugurates a life of active peacemaking within the believing community."
      },
      {
        "id": "eucharist_remembering_forgiving_victim",
        "title": "Eucharist: remembering a forgiving victim—politics of the table",
        "detail": "\n<br/>\nAt the Lord’s Supper, the church rehearses the story of the executed yet triumphant Messiah. Sharing bread and cup around a common table dismantles hierarchies that the powers maintain. The meal forms believers into a body that rejects violence by commemorating a victim who forgave. Thus Eucharist becomes both memory and mandate for reconciling action."
      },
      {
        "id": "cruciform_practices_enemy_love_economic_sharing_truth_telling",
        "title": "Cruciform practices: enemy-love, economic sharing, truth-telling",
        "detail": "\n<br/>\nDaily discipleship translates theology into habits that mirror Jesus’ self-giving. Loving adversaries breaks cycles of retaliation; sharing resources subverts consumerist greed; speaking truth foregoes manipulation. Weaver maintains that these embodied disciplines testify more loudly than creeds to the reality of Christ’s victory. They are the tangible fruits of a nonviolent atonement."
      },
      {
        "id": "church_as_visual_aid_of_nonviolence",
        "title": "Church as “visual aid” of atonement—incarnating nonviolence",
        "detail": "\n<br/>\nThe congregation, shaped by baptism and table, becomes an enacted parable of God’s reconciling work. Its life together shows the world what redeemed relationships look like. By refusing lethal force and practicing restorative justice, the church dramatizes the cross-resurrection story. Such visibility is crucial; without it, Weaver warns, the doctrine of atonement remains theoretical."
      }
    ]
  }
}
