{
  "title": "I. Historical & Ethical Critique of Traditional Atonement",
  "heroImage": "https://cdn.midjourney.com/aab2479a-5006-44ec-b4cc-d75ce0708b4d/0_3.png",
  "ethical_objections_to_divine_violence": {
    "title": "Ethical Objections to Divine Violence",
    "items": [
      {
        "id": "divine_child_abuse_charge_pastoral_fallout",
        "title": "Divine child-abuse charge and pastoral fallout",
        "detail": "\n<br/>\nWeaver contends that portraying the cross as a Father violently punishing the Son misrepresents God’s character and fractures pastoral care. Such imagery can retraumatize abuse survivors by sacralizing violence in intimate relationships. It also undermines the gospel’s invitation to trust a God of self-giving love rather than punitive fury. By rejecting the child-abuse analogy, Weaver opens space for nonviolent atonement models that heal rather than harm."
      },
      {
        "id": "sacrificial_logic_legitimizing_crusades_colonialism_patriarchy",
        "title": "Sacrificial logic legitimizing crusades, colonialism, patriarchy",
        "detail": "\n<br/>\nHe argues that substitutionary rhetoric has historically buttressed coercive power structures—from medieval crusades to modern colonial projects—by framing domination as divinely sanctioned sacrifice. When victory and violence appear woven into salvation’s fabric, church and state readily merge militant aims. Patriarchal hierarchies likewise find support when divine violence is normalized in worship and doctrine. Weaver’s critique calls Christians to disentangle salvation from conquest."
      },
      {
        "id": "trauma_informed_critique_penal_images_survivor_retraumatization",
        "title": "Trauma-informed critique: penal images and survivor retraumatization",
        "detail": "\n<br/>\nDrawing on trauma studies, Weaver notes that images of wrathful punishment can trigger intrusive memories for those with violent pasts. Penal metaphors center pain and debt, often silencing lament and minimizing victims’ experiences. Atonement language, he suggests, must foster safety and agency rather than replay cycles of fear. Narrative Christus Victor shifts the focus from punitive payment to God’s liberating solidarity."
      },
      {
        "id": "substitutionary_preaching_shapes_congregational_spirituality",
        "title": "How substitutionary preaching shapes congregational spirituality",
        "detail": "\n<br/>\nSermons framed around debt payment tend to cultivate passive gratitude rather than active discipleship. Weaver observes that congregations steeped in substitutionary themes may equate faith with mental assent rather than cruciform living. Over time this narrows moral imagination, making enemy-love appear optional. A narrative, liberation-oriented telling of the cross invites believers to participate in God’s nonviolent mission."
      }
    ]
  },
  "inadequacy_of_satisfaction_penal_theories": {
    "title": "Inadequacy of Satisfaction / Penal Theories",
    "items": [
      {
        "id": "feudal_honor_vs_covenantal_partnership",
        "title": "Feudal honor vs. covenantal partnership in Scripture",
        "detail": "\n<br/>\nWeaver contrasts Anselm’s honor economy—rooted in medieval lord-vassal codes—with the Bible’s relational covenant motifs. Scripture depicts God pursuing mutual faithfulness, not demanding satisfaction of wounded honor. Penal models thus import an alien social logic into biblical theology. Reframing salvation as covenantal restoration realigns atonement language with the narrative sweep of Scripture."
      },
      {
        "id": "courtroom_metaphors_eclipsing_apocalyptic_conflict_imagery",
        "title": "Courtroom metaphors eclipsing apocalyptic conflict imagery",
        "detail": "\n<br/>\nPenal substitution centers a legal verdict, while the New Testament foregrounds a cosmic battle against enslaving powers. Weaver argues that courtroom imagery shrinks salvation to individual guilt management, overlooking Christ’s victory over systemic evil. Apocalyptic language of liberation better accounts for the cross-resurrection event. Recovering this conflict frame broadens atonement beyond jurisprudence to cosmic renewal."
      },
      {
        "id": "payment_model_silence_on_liberation_from_systemic_evil",
        "title": "“Payment” model’s silence on liberation from systemic evil",
        "detail": "\n<br/>\nTreating sin as a debt to be settled can mask structural injustice by reducing salvation to ledger balancing. Weaver insists that true redemption dismantles oppressive principalities, not just erases moral deficits. Narrative Christus Victor foregrounds freedom from bondage—economic, political, and spiritual. This emphasis better equips the church to confront modern systems of exploitation."
      },
      {
        "id": "neglect_jesus_ministry_and_resurrection",
        "title": "Neglect of Jesus’ ministry & resurrection within legal frames",
        "detail": "\n<br/>\nFocusing narrowly on the crucifixion event risks sidelining Jesus’ life-teaching and the vindicating power of resurrection. Weaver shows that legal metaphors often treat incarnation and ministry as mere prerequisites for a transactional death. By contrast, a narrative approach integrates healing miracles, parables, and resurrection as integral to God’s saving storyline. This holistic view sustains ethical imitation and hope."
      }
    ]
  },
  "radical_reformation_mennonite_peace_roots": {
    "title": "Radical-Reformation & Mennonite Peace Roots",
    "items": [
      {
        "id": "believers_church_communal_hermeneutic",
        "title": "Believer’s-church communal hermeneutic",
        "detail": "\n<br/>\nWeaver draws on Anabaptist tradition where interpretation happens in accountable communities rather than ecclesial elites. Shared discernment guards against coercive doctrines by centering lived obedience. This method privileges narratives of Jesus’ peaceable kingdom over abstract dogma. It thus undergirds his participatory, nonviolent atonement model."
      },
      {
        "id": "sermon_on_the_mount_nonresistance_ethic",
        "title": "Sermon on the Mount as normative ethic of nonresistance",
        "detail": "\n<br/>\nFor Mennonites, Matthew 5–7 is not an unreachable ideal but Christianity’s constitution. Weaver mines these chapters to show that enemy-love and refusal of retaliation are core to Jesus’ saving work. The cross embodies, rather than suspends, this ethic of radical forgiveness. Atonement therefore commissions disciples to embody the same peacemaking posture."
      },
      {
        "id": "politics_of_shalom_missional_identity",
        "title": "Politics of shalom as missional identity",
        "detail": "\n<br/>\nShalom, in Weaver’s reading, is the social hallmark of God’s reign—wholeness, justice, and communal flourishing. The church’s mission is to anticipate that reign through practices of reconciliation and economic sharing. A nonviolent atonement supplies the theological engine for such politics, rooting activism in the character of the crucified-risen Christ. Thus salvation and social transformation are inseparable."
      }
    ]
  }
}
