{
    "title": "I. The Inadequacy of Mere Theory & the Primacy of Story",
    "heroImage": "",
    "rejecting_systematic_reduction": {
        "title": "Rejecting Systematic Reduction of Mystery",
        "items": [
            {
                "id": "theories_not_christianity",
                "title": "Not just an attribute, but God's essence",
                "detail": "\n<br/>\nThe central Christian belief is that Christ's death has somehow put us right with God and given us a fresh start. But theories as to how it did this are another matter entirely. A man can eat his dinner without understanding exactly how food nourishes him, and a man can accept what Christ has done without knowing how it works. The thing itself is infinitely more important than any explanations theologians have produced. We must never confuse the reality with our fumbling attempts to describe it.\n<br/><br/>\n<i>See Mere Christianity, Chapter 4</i>"
            },
            {
                "id": "police_court_critique",
                "title": "Critique of 'police-court' mentality reducing divine action to legal transactions",
                "detail": "\n<br/>\nThe notion that God wanted to punish men but Christ volunteered to be punished instead seems, on the face of it, rather silly. If God was prepared to let us off, why on earth did He not do so? What possible point could there be in punishing an innocent person? This way of thinking reduces the cosmic drama to a courtroom transaction, missing entirely the deeper magic at work. Divine love operates by principles far more profound than human jurisprudence, principles that transform rather than merely acquit.\n<br/><br/>\n<i>See Mere Christianity, Chapter 4</i>"
            },
            {
                "id": "multiple_biblical_metaphors",
                "title": "Multiple biblical metaphors as partial glimpses",
                "detail": "\n<br/>\nThe ideas of sacrifice, ransom, championship over death, and substitution are all images to suggest the reality of the atonement, not scientific definitions that contain and limit the truth. To fix on any one of them as if it were the complete explanation would be a mistake. Like a jewel held to the light, the mystery reveals different faces from different angles, each catching something true but none exhausting the brilliance. Scripture offers us a symphony of metaphors because no single instrument could play the full melody of redemption.\n<br/><br/>\n<i>See Collected Letters, Volume III, p. 1476</i>"
            }
        ]
    },
    "christianity_as_true_myth": {
        "title": "Christianity as 'True Myth' Rather Than Proposition",
        "items": [
            {
                "id": "myth_as_vehicle_of_truth",
                "title": "Myth as the vehicle of deepest truth",
                "detail": "\n<br/>\nMyth is the mountain whence all the different streams arise which become truths down here in the valley of abstraction. What flows into you from myth is not truth but reality itself, for truth is always about something, but reality is that about which truth is. Every myth becomes the father of innumerable truths on the abstract level, but myth itself transcends thought just as incarnation transcends myth. The deepest things cannot be captured in propositions but only in stories that awaken the heart to recognize what it has always known."
            },
            {
                "id": "universal_patterns",
                "title": "Universal patterns in dying/rising god myths point toward ultimate reality",
                "detail": "\n<br/>\nThe old myth of the dying god appears in cultures across the world not by accident but by design. These stories are God expressing Himself through the minds of poets, using such images as He found there, preparing the human heart to recognize the True Myth when it arrived. Like shadows cast before the rising sun, these tales whispered of a coming reality. When the Word became flesh, He did not contradict these ancient longings but fulfilled them, being what they had always pointed toward—the Dying God who actually died and rose again."
            },
            {
                "id": "myth_became_fact",
                "title": "The Incarnation as 'myth became fact'",
                "detail": "\n<br/>\nThe heart of Christianity is a myth which is also a fact. The old myth of the dying god, without ceasing to be myth, comes down from the heaven of legend and imagination to the earth of history. It happens at a particular date, in a particular place, followed by definable historical consequences. We pass from a Balder or an Osiris, dying nobody knows when or where, to a historical person crucified under Pontius Pilate. The eternal pattern that human hearts recognized in story has stepped into time itself.\n<br/><br/>\n<i>See 'Myth Became Fact' essay</i>"
            },
            {
                "id": "god_expressing_through_real_things",
                "title": "God expressing Himself through 'real things' rather than human imagination alone",
                "detail": "\n<br/>\nThe pagan stories are God expressing Himself through the minds of poets, using such images as He found there, while Christianity is God expressing Himself through what we call real things. Therefore it is true, not in the sense of being a description of God—that no finite mind could take in—but in the sense of being the way in which God chooses to appear to our faculties. The actual incarnation, crucifixion, and resurrection are God's own language, more adequate than any human words, spoken in the grammar of history itself."
            }
        ]
    }
}